Revit 2024 API
ImporterIFC Class
 The main class provided by Revit to allow implementation of IFC import.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class ImporterIFC : IDisposable
Visual Basic
Public Class ImporterIFC _
	Implements IDisposable
Visual C++
public ref class ImporterIFC : IDisposable
Remarks
 An instance of this class is provided to clients which implement IImporterIFC in order to provide an implementation for IFC import. It contains information on the options selected by the user for the import operation, as well as members used to access specific types of data needed to implement the import properly.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.ImporterIFC
See Also
ImporterIFC Members
Autodesk.Revit.DB.IFC Namespace